---
kind: property
id: P:Autodesk.Revit.DB.ViewScheduleExportOptions.IsValidObject
source: html/ebabf145-82e7-a4c7-6039-02d507b02a27.htm
---
# Autodesk.Revit.DB.ViewScheduleExportOptions.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.